https://leetcode.com/problems/combine-two-tables/

In [1]:
import pandas as pd
import numpy as np 
import sqlite3

In [2]:
sql = '''
Create table If Not Exists Person (personId int, firstName varchar(255), lastName varchar(255));
Create table If Not Exists Address (addressId int, personId int, city varchar(255), state varchar(255));
---Truncate table Person
insert into Person (personId, lastName, firstName) values ('1', 'Wang', 'Allen');
insert into Person (personId, lastName, firstName) values ('2', 'Alice', 'Bob');
---Truncate table Address
insert into Address (addressId, personId, city, state) values ('1', '2', 'New York City', 'New York');
insert into Address (addressId, personId, city, state) values ('2', '3', 'Leetcode', 'California');
'''

In [3]:
def select(sql):
    return pd.read_sql(sql, con)

In [4]:
con = sqlite3.connect('db')

In [5]:
cur = con.cursor()

In [6]:
cur.executescript(sql)

In [13]:
sql = '''
SELECT *
FROM Person AS p
'''

In [14]:
select(sql)

   personId firstName lastName
0         1     Allen     Wang
1         2       Bob    Alice

In [15]:
sql = '''
SELECT *
FROM Person AS p
LEFT JOIN Address as a ON
p.personId = a.personId
'''

In [16]:
select(sql)

   personId firstName lastName  addressId  personId           city     state
0         1     Allen     Wang        NaN       NaN           None      None
1         2       Bob    Alice        1.0       2.0  New York City  New York

In [19]:
sql = '''
SELECT p.firstName, p.lastName, a.city, a.state
FROM Person AS p
LEFT JOIN Address AS a ON
p.personId = a.personId
'''

In [20]:
select(sql)

  firstName lastName           city     state
0     Allen     Wang           None      None
1       Bob    Alice  New York City  New York